### Ref. datacamp

In [1]:
import pandas as pd
import numpy as np

In [4]:
df1 = pd.read_csv('./pandasDataSets/weather_data_austin_2010.csv')

In [5]:
df1.head()

   Temperature  DewPoint  Pressure            Date
0         46.2      37.5       1.0  20100101 00:00
1         44.6      37.1       1.0  20100101 01:00
2         44.1      36.9       1.0  20100101 02:00
3         43.8      36.9       1.0  20100101 03:00
4         43.5      36.8       1.0  20100101 04:00

In [38]:
dd = {'Name': ['Swaroopa', 'Sushant', 'Champak'], 'Email': ['swaroopa.kadam07@gmail.com', 'sushant.2811@gmail.com',  ] }

In [40]:
ddf = pd.DataFrame(dd)

In [67]:
len(np.nan)

TypeError: object of type 'float' has no len()

In [41]:
ddf

                        Email      Name
0  swaroopa.kadam07@gmail.com  Swaroopa
1      sushant.2811@gmail.com   Sushant
2          campak@champak.com   Champak

In [42]:
ddf['Email']

0    swaroopa.kadam07@gmail.com
1        sushant.2811@gmail.com
2            campak@champak.com
Name: Email, dtype: object

In [43]:
email = 'sushant.2811@gmail.com'

In [44]:
len(email.split('@')[0])

12

In [63]:
f = lambda x: len(x.split('@')[0]) if len(x) > 0 else 0

In [60]:
ddf['lenEmail'] = ddf['Email'].apply(lambda x: (len(x.split('@')[0])))

In [64]:
ddf['lenEmailf'] = ddf['Email'].apply(f)

In [49]:
ddf.loc[:,'lenEmail']

0    16
1    12
2     6
Name: lenEmail, dtype: int64

In [65]:
ddf.loc[:,'lenEmailf']

0    16
1    12
2     6
Name: lenEmailf, dtype: int64

In [56]:
y = 2;

In [61]:
x = 3 if y >2

SyntaxError: invalid syntax (<ipython-input-61-62daf126ce66>, line 1)

In [58]:
x

0

In [6]:
df2 = pd.read_csv('./pandasDataSets/NOAA_QCLCD_2011_hourly_13904.txt')

In [7]:
df2.head()

,13904,20110101,0053,12,OVC045,,10.00,.1,.2,.3,...,.18,.19,29.95,.20,AA,.21,.22,.23,29.95.1,.24
0,13904,20110101,153,12,OVC049,,10.00,,,,...,,,30.01,,AA,,,,30.02,
1,13904,20110101,253,12,OVC060,,10.00,,,,...,030,,30.01,,AA,,,,30.02,
2,13904,20110101,353,12,OVC065,,10.00,,,,...,,,30.03,,AA,,,,30.04,
3,13904,20110101,453,12,BKN070,,10.00,,,,...,,,30.04,,AA,,,,30.04,
4,13904,20110101,553,12,BKN065,,10.00,,,,...,015,,30.06,,AA,,,,30.06,

In [8]:
df2_noheader = pd.read_csv('./pandasDataSets/NOAA_QCLCD_2011_hourly_13904.txt', header=None)

In [9]:
df2_noheader.head()

,0,1,2,3,4,5,6,7,8,9,...,34,35,36,37,38,39,40,41,42,43
0,13904,20110101,53,12,OVC045,,10.00,,,,...,,,29.95,,AA,,,,29.95,
1,13904,20110101,153,12,OVC049,,10.00,,,,...,,,30.01,,AA,,,,30.02,
2,13904,20110101,253,12,OVC060,,10.00,,,,...,030,,30.01,,AA,,,,30.02,
3,13904,20110101,353,12,OVC065,,10.00,,,,...,,,30.03,,AA,,,,30.04,
4,13904,20110101,453,12,BKN070,,10.00,,,,...,,,30.04,,AA,,,,30.04,

In [10]:
column_labels = 'Wban,date,Time,StationType,sky_condition,sky_conditionFlag,visibility,visibilityFlag,wx_and_obst_to_vision,wx_and_obst_to_visionFlag,dry_bulb_faren,dry_bulb_farenFlag,dry_bulb_cel,dry_bulb_celFlag,wet_bulb_faren,wet_bulb_farenFlag,wet_bulb_cel,wet_bulb_celFlag,dew_point_faren,dew_point_farenFlag,dew_point_cel,dew_point_celFlag,relative_humidity,relative_humidityFlag,wind_speed,wind_speedFlag,wind_direction,wind_directionFlag,value_for_wind_character,value_for_wind_characterFlag,station_pressure,station_pressureFlag,pressure_tendency,pressure_tendencyFlag,presschange,presschangeFlag,sea_level_pressure,sea_level_pressureFlag,record_type,hourly_precip,hourly_precipFlag,altimeter,altimeterFlag,junk'

In [20]:
column_labels_list = column_labels.split(',')

In [21]:
column_labels_list

['Wban',
 'date',
 'Time',
 'StationType',
 'sky_condition',
 'sky_conditionFlag',
 'visibility',
 'visibilityFlag',
 'wx_and_obst_to_vision',
 'wx_and_obst_to_visionFlag',
 'dry_bulb_faren',
 'dry_bulb_farenFlag',
 'dry_bulb_cel',
 'dry_bulb_celFlag',
 'wet_bulb_faren',
 'wet_bulb_farenFlag',
 'wet_bulb_cel',
 'wet_bulb_celFlag',
 'dew_point_faren',
 'dew_point_farenFlag',
 'dew_point_cel',
 'dew_point_celFlag',
 'relative_humidity',
 'relative_humidityFlag',
 'wind_speed',
 'wind_speedFlag',
 'wind_direction',
 'wind_directionFlag',
 'value_for_wind_character',
 'value_for_wind_characterFlag',
 'station_pressure',
 'station_pressureFlag',
 'pressure_tendency',
 'pressure_tendencyFlag',
 'presschange',
 'presschangeFlag',
 'sea_level_pressure',
 'sea_level_pressureFlag',
 'record_type',
 'hourly_precip',
 'hourly_precipFlag',
 'altimeter',
 'altimeterFlag',
 'junk']

In [13]:
df2_noheader.columns = column_labels_list

In [14]:
df2_noheader.head()

,Wban,date,Time,StationType,sky_condition,sky_conditionFlag,visibility,visibilityFlag,wx_and_obst_to_vision,wx_and_obst_to_visionFlag,...,presschange,presschangeFlag,sea_level_pressure,sea_level_pressureFlag,record_type,hourly_precip,hourly_precipFlag,altimeter,altimeterFlag,junk
0,13904,20110101,53,12,OVC045,,10.00,,,,...,,,29.95,,AA,,,,29.95,
1,13904,20110101,153,12,OVC049,,10.00,,,,...,,,30.01,,AA,,,,30.02,
2,13904,20110101,253,12,OVC060,,10.00,,,,...,030,,30.01,,AA,,,,30.02,
3,13904,20110101,353,12,OVC065,,10.00,,,,...,,,30.03,,AA,,,,30.04,
4,13904,20110101,453,12,BKN070,,10.00,,,,...,,,30.04,,AA,,,,30.04,

In [22]:
list_to_drop = ['sky_conditionFlag',
 'visibilityFlag',
 'wx_and_obst_to_vision',
 'wx_and_obst_to_visionFlag',
 'dry_bulb_farenFlag',
 'dry_bulb_celFlag',
 'wet_bulb_farenFlag',
 'wet_bulb_celFlag',
 'dew_point_farenFlag',
 'dew_point_celFlag',
 'relative_humidityFlag',
 'wind_speedFlag',
 'wind_directionFlag',
 'value_for_wind_character',
 'value_for_wind_characterFlag',
 'station_pressureFlag',
 'pressure_tendencyFlag',
 'pressure_tendency',
 'presschange',
 'presschangeFlag',
 'sea_level_pressureFlag',
 'hourly_precip',
 'hourly_precipFlag',
 'altimeter',
 'record_type',
 'altimeterFlag',
 'junk']

In [23]:
df2_dropped = df2_noheader.drop(list_to_drop, axis = 1)

In [25]:
df2_dropped.head()

,Wban,date,Time,StationType,sky_condition,visibility,dry_bulb_faren,dry_bulb_cel,wet_bulb_faren,wet_bulb_cel,dew_point_faren,dew_point_cel,relative_humidity,wind_speed,wind_direction,station_pressure,sea_level_pressure
0,13904,20110101,53,12,OVC045,10.00,51,10.6,38,3.1,15,-9.4,24,15,360,29.42,29.95
1,13904,20110101,153,12,OVC049,10.00,51,10.6,37,3.0,14,-10.0,23,10,340,29.49,30.01
2,13904,20110101,253,12,OVC060,10.00,51,10.6,37,2.9,13,-10.6,22,15,010,29.49,30.01
3,13904,20110101,353,12,OVC065,10.00,50,10.0,38,3.1,17,-8.3,27,7,350,29.51,30.03
4,13904,20110101,453,12,BKN070,10.00,50,10.0,37,2.8,15,-9.4,25,11,020,29.51,30.04

In [30]:
df2_noheader.shape

(10337, 44)

In [31]:
df2_dropped.shape

(10337, 17)

In [33]:
df2_dropped.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10337 entries, 0 to 10336
Data columns (total 17 columns):
Wban                  10337 non-null int64
date                  10337 non-null int64
Time                  10337 non-null int64
StationType           10337 non-null int64
sky_condition         10337 non-null object
visibility            10337 non-null object
dry_bulb_faren        10337 non-null object
dry_bulb_cel          10337 non-null object
wet_bulb_faren        10337 non-null object
wet_bulb_cel          10337 non-null object
dew_point_faren       10337 non-null object
dew_point_cel         10337 non-null object
relative_humidity     10337 non-null object
wind_speed            10337 non-null object
wind_direction        10337 non-null object
station_pressure      10337 non-null object
sea_level_pressure    10337 non-null object
dtypes: int64(4), object(13)
memory usage: 1.3+ MB

To use the full power of pandas time series, we convert the date column, to a DateTimeIndex.

In [37]:
df2_dropped['date'] = df2_dropped['date'].astype(str)

In [38]:
df2_dropped.dtypes

Wban                   int64
date                  object
Time                   int64
StationType            int64
sky_condition         object
visibility            object
dry_bulb_faren        object
dry_bulb_cel          object
wet_bulb_faren        object
wet_bulb_cel          object
dew_point_faren       object
dew_point_cel         object
relative_humidity     object
wind_speed            object
wind_direction        object
station_pressure      object
sea_level_pressure    object
dtype: object

In [39]:
df2_dropped['Time'].head()

0     53
1    153
2    253
3    353
4    453
Name: Time, dtype: int64

In [63]:
'{:1>4}'.format(5234)

'5234'

In [60]:
df2_dropped['Time'] = df2_dropped['Time'].apply(lambda x:'{:0>4}'.format(x))

In [61]:
df2_dropped['Time'].head()

0    0053
1    0153
2    0253
3    0353
4    0453
Name: Time, dtype: object

In [64]:
date_string = df2_dropped['date'] + df2_dropped['Time']

In [66]:
date_string.head()

0    201101010053
1    201101010153
2    201101010253
3    201101010353
4    201101010453
dtype: object

In [68]:
date_string.dtypes

dtype('O')

In [69]:
date_times = pd.to_datetime(date_string)

In [71]:
date_times.head()

0   2011-01-01 00:53:00
1   2011-01-01 01:53:00
2   2011-01-01 02:53:00
3   2011-01-01 03:53:00
4   2011-01-01 04:53:00
dtype: datetime64[ns]

In [72]:
date_times = pd.to_datetime(date_string, format='%Y%m%d%H%M')

In [74]:
date_times.head()

0   2011-01-01 00:53:00
1   2011-01-01 01:53:00
2   2011-01-01 02:53:00
3   2011-01-01 03:53:00
4   2011-01-01 04:53:00
dtype: datetime64[ns]

In [96]:
df2_clean = df2_dropped.set_index(date_times)

In [97]:
df2_clean.head()

,Wban,date,Time,StationType,sky_condition,visibility,dry_bulb_faren,dry_bulb_cel,wet_bulb_faren,wet_bulb_cel,dew_point_faren,dew_point_cel,relative_humidity,wind_speed,wind_direction,station_pressure,sea_level_pressure
2011-01-01 00:53:00,13904,20110101,0053,12,OVC045,10.00,51,10.6,38,3.1,15,-9.4,24,15,360,29.42,29.95
2011-01-01 01:53:00,13904,20110101,0153,12,OVC049,10.00,51,10.6,37,3.0,14,-10.0,23,10,340,29.49,30.01
2011-01-01 02:53:00,13904,20110101,0253,12,OVC060,10.00,51,10.6,37,2.9,13,-10.6,22,15,010,29.49,30.01
2011-01-01 03:53:00,13904,20110101,0353,12,OVC065,10.00,50,10.0,38,3.1,17,-8.3,27,7,350,29.51,30.03
2011-01-01 04:53:00,13904,20110101,0453,12,BKN070,10.00,50,10.0,37,2.8,15,-9.4,25,11,020,29.51,30.04

In [98]:
df2_clean.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 10337 entries, 2011-01-01 00:53:00 to 2011-12-31 23:53:00
Data columns (total 17 columns):
Wban                  10337 non-null int64
date                  10337 non-null object
Time                  10337 non-null object
StationType           10337 non-null int64
sky_condition         10337 non-null object
visibility            10337 non-null object
dry_bulb_faren        10337 non-null object
dry_bulb_cel          10337 non-null object
wet_bulb_faren        10337 non-null object
wet_bulb_cel          10337 non-null object
dew_point_faren       10337 non-null object
dew_point_cel         10337 non-null object
relative_humidity     10337 non-null object
wind_speed            10337 non-null object
wind_direction        10337 non-null object
station_pressure      10337 non-null object
sea_level_pressure    10337 non-null object
dtypes: int64(2), object(15)
memory usage: 1.4+ MB

In [99]:
df2_clean.loc['2011-06-20 08:00:00':'2011-06-20 09:00:00','dry_bulb_faren']

2011-06-20 08:27:00     M
2011-06-20 08:28:00     M
2011-06-20 08:29:00     M
2011-06-20 08:30:00     M
2011-06-20 08:31:00     M
2011-06-20 08:32:00     M
2011-06-20 08:33:00     M
2011-06-20 08:34:00     M
2011-06-20 08:35:00     M
2011-06-20 08:53:00    83
Name: dry_bulb_faren, dtype: object

In [100]:
pd.to_numeric(df2_clean.loc['2011-06-20 08:00:00':'2011-06-20 09:00:00','dry_bulb_faren'], errors='coerce')

2011-06-20 08:27:00     NaN
2011-06-20 08:28:00     NaN
2011-06-20 08:29:00     NaN
2011-06-20 08:30:00     NaN
2011-06-20 08:31:00     NaN
2011-06-20 08:32:00     NaN
2011-06-20 08:33:00     NaN
2011-06-20 08:34:00     NaN
2011-06-20 08:35:00     NaN
2011-06-20 08:53:00    83.0
Name: dry_bulb_faren, dtype: float64

In [101]:
(pd.to_numeric(df2_clean.loc['2011-06-20 08:00:00':'2011-06-20 09:00:00','dry_bulb_faren'], errors='coerce')).dtype

dtype('float64')

Convert the 'dry_bulb_faren' column to numeric values with pd.to_numeric(). Specify errors='coerce' to force strings like 'M' to be interpreted as NaN.

In [102]:
df2_clean['dry_bulb_faren'] = pd.to_numeric(df2_clean['dry_bulb_faren'],
                                           errors = 'coerce')

In [103]:
df2_clean['dry_bulb_faren'].head()

2011-01-01 00:53:00    51.0
2011-01-01 01:53:00    51.0
2011-01-01 02:53:00    51.0
2011-01-01 03:53:00    50.0
2011-01-01 04:53:00    50.0
Name: dry_bulb_faren, dtype: float64

In [104]:
df2_clean['wind_speed'] = pd.to_numeric(df2_clean['wind_speed'], errors='coerce')

In [105]:
df2_clean['dew_point_faren'] = pd.to_numeric(df2_clean['dew_point_faren'], errors='coerce')

In [107]:
df2_clean['dew_point_faren'].head()

2011-01-01 00:53:00    15.0
2011-01-01 01:53:00    14.0
2011-01-01 02:53:00    13.0
2011-01-01 03:53:00    17.0
2011-01-01 04:53:00    15.0
Name: dew_point_faren, dtype: float64

Statistical EDA

In [108]:
df2_clean['dry_bulb_faren'].median()

72.0

In [110]:
df2_clean.loc['2011-Apr':'2011-Jun', 'dry_bulb_faren'].median()

78.0

In [111]:
df2_clean.loc['2011-Jan', 'dry_bulb_faren'].median()

48.0

Above getting median for the month of January.

In [2]:
election = pd.read_csv('./pandasDataSets/pennsylvania2012_turnout.csv')

In [3]:
election.head()

,county,state,total,Obama,Romney,winner,voters,turnout,margin
0,Adams,PA,41973,35.482334,63.112001,Romney,61156,68.632677,27.629667
1,Allegheny,PA,614671,56.640219,42.185820,Obama,924351,66.497575,14.454399
2,Armstrong,PA,28322,30.696985,67.901278,Romney,42147,67.198140,37.204293
3,Beaver,PA,80015,46.032619,52.637630,Romney,115157,69.483401,6.605012
4,Bedford,PA,21444,22.057452,76.986570,Romney,32189,66.619031,54.929118

In [4]:
election = pd.read_csv('./pandasDataSets/pennsylvania2012_turnout.csv', index_col='county')

In [5]:
election.head()

,state,total,Obama,Romney,winner,voters,turnout,margin
county,,,,,,,,
Adams,PA,41973,35.482334,63.112001,Romney,61156,68.632677,27.629667
Allegheny,PA,614671,56.640219,42.185820,Obama,924351,66.497575,14.454399
Armstrong,PA,28322,30.696985,67.901278,Romney,42147,67.198140,37.204293
Beaver,PA,80015,46.032619,52.637630,Romney,115157,69.483401,6.605012
Bedford,PA,21444,22.057452,76.986570,Romney,32189,66.619031,54.929118

In [6]:
election.loc['Perry':'Potter']

,state,total,Obama,Romney,winner,voters,turnout,margin
county,,,,,,,,
Perry,PA,18240,29.769737,68.591009,Romney,27245,66.948064,38.821272
Philadelphia,PA,653598,85.224251,14.051451,Obama,1099197,59.461407,71.172800
Pike,PA,23164,43.904334,54.882576,Romney,41840,55.363289,10.978242
Potter,PA,7205,26.259542,72.158223,Romney,10913,66.022175,45.898681

In [7]:
election.loc['Potter':'Perry':-1]

,state,total,Obama,Romney,winner,voters,turnout,margin
county,,,,,,,,
Potter,PA,7205,26.259542,72.158223,Romney,10913,66.022175,45.898681
Pike,PA,23164,43.904334,54.882576,Romney,41840,55.363289,10.978242
Philadelphia,PA,653598,85.224251,14.051451,Obama,1099197,59.461407,71.172800
Perry,PA,18240,29.769737,68.591009,Romney,27245,66.948064,38.821272

### Multi-index

In [2]:
df = pd.read_csv('./datasets/sales/sales-feb-2015.csv')

In [3]:
df.head()

                  Date          Company   Product  Units
0  2015-02-02 08:30:00            Hooli  Software      3
1  2015-02-02 21:00:00        Mediacore  Hardware      9
2  2015-02-03 14:00:00          Initech  Software     13
3  2015-02-04 15:30:00        Streeplex  Software     13
4  2015-02-04 22:00:00  Acme Coporation  Hardware     14

**Aggregate group by**

In [4]:
df_titanic = pd.read_csv('./datasets/titanic.csv')

In [5]:
df_titanic.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [7]:
df_titanic.groupby('pclass')[['fare', 'age']].agg('sum')

              fare       age
pclass
1       28265.4043  11121.42
2        5866.6374   7701.25
3        9418.4452  12433.00

In [8]:
df_titanic.groupby('pclass')[['fare', 'age']].agg(['sum', 'median'])

              fare                age
               sum   median       sum median
pclass
1       28265.4043  60.0000  11121.42   39.0
2        5866.6374  15.0458   7701.25   29.0
3        9418.4452   8.0500  12433.00   24.0

Getting median age and fare in each class.

In [9]:
aggregated_titanic = df_titanic.groupby('pclass')[['fare', 'age']].agg(['sum', 'median'])

In [10]:
aggregated_titanic.loc[:, ('fare', 'median')]

pclass
1    60.0000
2    15.0458
3     8.0500
Name: (fare, median), dtype: float64

In [11]:
aggregated_titanic.loc[:, ('age', 'median')]

pclass
1    39.0
2    29.0
3    24.0
Name: (age, median), dtype: float64

In [106]:
gapminder = pd.read_csv('./datasets/gapminder_tidy.csv')

In [14]:
gapminder.head()

,Country,Year,fertility,life,population,child_mortality,gdp,region
0,Afghanistan,1964,7.671,33.639,10474903.0,339.7,1182.0,South Asia
1,Afghanistan,1965,7.671,34.152,10697983.0,334.1,1182.0,South Asia
2,Afghanistan,1966,7.671,34.662,10927724.0,328.7,1168.0,South Asia
3,Afghanistan,1967,7.671,35.170,11163656.0,323.3,1173.0,South Asia
4,Afghanistan,1968,7.671,35.674,11411022.0,318.1,1187.0,South Asia

In [15]:
gapminder_multiindex = pd.read_csv('./datasets/gapminder_tidy.csv', index_col=['Year','region','Country'])

In [28]:
gapminder_multiindex_sorted = pd.read_csv('./datasets/gapminder_tidy.csv', index_col=['Year','region','Country']).sort_index()

In [29]:
gapminder_multiindex_sorted.head()

                                  fertility    life  population  \
Year region  Country
1964 America Antigua and Barbuda      4.250  63.775     58653.0
             Argentina                3.068  65.388  21966478.0
             Aruba                    4.059  67.113     57031.0
             Bahamas                  4.220  64.189    133709.0
             Barbados                 4.094  62.819    234455.0

                                  child_mortality      gdp
Year region  Country
1964 America Antigua and Barbuda            72.78   5008.0
             Argentina                      57.43   8227.0
             Aruba                            NaN   5505.0
             Bahamas                        48.56  18160.0
             Barbados                       64.70   5681.0

In [16]:
gapminder_multiindex.head()

,,,fertility,life,population,child_mortality,gdp
Year,region,Country,,,,,
1964,South Asia,Afghanistan,7.671,33.639,10474903.0,339.7,1182.0
1965,South Asia,Afghanistan,7.671,34.152,10697983.0,334.1,1182.0
1966,South Asia,Afghanistan,7.671,34.662,10927724.0,328.7,1168.0
1967,South Asia,Afghanistan,7.671,35.170,11163656.0,323.3,1173.0
1968,South Asia,Afghanistan,7.671,35.674,11411022.0,318.1,1187.0

In [17]:
by_year_region = gapminder_multiindex.groupby(level = ['Year', 'region'])

In [22]:
by_year_region2 = gapminder_multiindex.groupby(['Year', 'region'])

In [25]:
gapminder_multiindex.groupby(['fertility', 'life'])

In [18]:
by_year_region

In [19]:
aggregator = {'population': 'sum', 'child_mortality': 'mean', 'gdp': lambda x: x.max() - x.min()}

In [23]:
by_year_region.agg(aggregator).head()

                                   population  child_mortality      gdp
Year region
1964 America                     4.621957e+08       113.950667  18314.0
     East Asia & Pacific         1.110668e+09       129.109130  66821.0
     Europe & Central Asia       6.988545e+08        61.585319  28734.0
     Middle East & North Africa  1.180955e+08       179.605263  38474.0
     South Asia                  6.250739e+08       256.922500    812.0

In [24]:
by_year_region2.agg(aggregator).head()

                                   population  child_mortality      gdp
Year region
1964 America                     4.621957e+08       113.950667  18314.0
     East Asia & Pacific         1.110668e+09       129.109130  66821.0
     Europe & Central Asia       6.988545e+08        61.585319  28734.0
     Middle East & North Africa  1.180955e+08       179.605263  38474.0
     South Asia                  6.250739e+08       256.922500    812.0

In [26]:
by_year_region2.agg(aggregator).tail()

                                   population  child_mortality       gdp
Year region
2013 East Asia & Pacific         2.244209e+09        22.285714  134744.0
     Europe & Central Asia       8.968788e+08         9.831875   86418.0
     Middle East & North Africa  4.030504e+08        20.221500  128676.0
     South Asia                  1.701241e+09        46.287500   11469.0
     Sub-Saharan Africa          9.205996e+08        76.944490   32035.0

In [31]:
by_year_region.agg(aggregator).tail(6)

                                   population  child_mortality       gdp
Year region
2013 America                     9.629087e+08        17.745833   49634.0
     East Asia & Pacific         2.244209e+09        22.285714  134744.0
     Europe & Central Asia       8.968788e+08         9.831875   86418.0
     Middle East & North Africa  4.030504e+08        20.221500  128676.0
     South Asia                  1.701241e+09        46.287500   11469.0
     Sub-Saharan Africa          9.205996e+08        76.944490   32035.0

In [30]:
by_year_region.agg(aggregator).loc[(2013, slice(None)), :]

                                   population  child_mortality       gdp
Year region
2013 America                     9.629087e+08        17.745833   49634.0
     East Asia & Pacific         2.244209e+09        22.285714  134744.0
     Europe & Central Asia       8.968788e+08         9.831875   86418.0
     Middle East & North Africa  4.030504e+08        20.221500  128676.0
     South Asia                  1.701241e+09        46.287500   11469.0
     Sub-Saharan Africa          9.205996e+08        76.944490   32035.0

Grouping on index

In [45]:
sales = pd.read_csv('./datasets/sales/sales-feb-2015.csv', index_col='Date', parse_dates=True)

In [46]:
sales

                             Company   Product  Units
Date
2015-02-02 08:30:00            Hooli  Software      3
2015-02-02 21:00:00        Mediacore  Hardware      9
2015-02-03 14:00:00          Initech  Software     13
2015-02-04 15:30:00        Streeplex  Software     13
2015-02-04 22:00:00  Acme Coporation  Hardware     14
2015-02-05 02:00:00  Acme Coporation  Software     19
2015-02-05 22:00:00            Hooli   Service     10
2015-02-07 23:00:00  Acme Coporation  Hardware      1
2015-02-09 09:00:00        Streeplex   Service     19
2015-02-09 13:00:00        Mediacore  Software      7
2015-02-11 20:00:00          Initech  Software      7
2015-02-11 23:00:00            Hooli  Software      4
2015-02-16 12:00:00            Hooli  Software     10
2015-02-19 11:00:00        Mediacore  Hardware     16
2015-02-19 16:00:00        Mediacore   Service     10
2015-02-21 05:00:00        Mediacore  Software      3
2015-02-21 20:30:00            Hooli  Hardware      3
2015-02-25 00:30:00          Initech   Service     10
2015-02-26 09:00:00        Streeplex   Service      4

In [47]:
sales.index.strftime('%A')

array(['Monday', 'Monday', 'Tuesday', 'Wednesday', 'Wednesday', 'Thursday',
       'Thursday', 'Saturday', 'Monday', 'Monday', 'Wednesday',
       'Wednesday', 'Monday', 'Thursday', 'Thursday', 'Saturday',
       'Saturday', 'Wednesday', 'Thursday'],
      dtype='<U9')

In [48]:
sales.index.strftime('%a')

array(['Mon', 'Mon', 'Tue', 'Wed', 'Wed', 'Thu', 'Thu', 'Sat', 'Mon',
       'Mon', 'Wed', 'Wed', 'Mon', 'Thu', 'Thu', 'Sat', 'Sat', 'Wed', 'Thu'],
      dtype='<U3')

In [49]:
sales.groupby(sales.index.strftime('%a'))['Units'].sum()

Mon    48
Sat     7
Thu    59
Tue    13
Wed    48
Name: Units, dtype: int64

strftime only works on datetime objects

**Using transform**

In [50]:
from scipy.stats import zscore

In [52]:
gapminder.head()

,Country,Year,fertility,life,population,child_mortality,gdp,region
0,Afghanistan,1964,7.671,33.639,10474903.0,339.7,1182.0,South Asia
1,Afghanistan,1965,7.671,34.152,10697983.0,334.1,1182.0,South Asia
2,Afghanistan,1966,7.671,34.662,10927724.0,328.7,1168.0,South Asia
3,Afghanistan,1967,7.671,35.170,11163656.0,323.3,1173.0,South Asia
4,Afghanistan,1968,7.671,35.674,11411022.0,318.1,1187.0,South Asia

In [54]:
gapminder.groupby('region')[['life', 'fertility']].mean()

                                 life  fertility
region
America                     68.722251   3.486061
East Asia & Pacific         66.108632   3.725836
Europe & Central Asia       71.931303   2.214177
Middle East & North Africa  65.194301   4.970019
South Asia                  57.137710   5.004162
Sub-Saharan Africa          51.664426   5.956105

In [56]:
gapminder.groupby('region')[['life', 'fertility']].transform(zscore).head()

       life  fertility
0 -2.289170   1.477737
1 -2.239195   1.477737
2 -2.189513   1.477737
3 -2.140025   1.477737
4 -2.090927   1.477737

In [57]:
gapminder.groupby('region')[['life', 'fertility']].transform(zscore).shape

(10111, 2)

In [58]:
gapminder.shape

(10111, 8)

In [67]:
gapminder.groupby('region')[['life', 'fertility']].apply(sum)

                                     life     fertility
region
America                     137444.502000   6972.122780
East Asia & Pacific         105839.919880   5961.337160
Europe & Central Asia       184144.135015   5646.152556
Middle East & North Africa   68454.016000   5218.520000
South Asia                   22855.084000   2001.665000
Sub-Saharan Africa          129161.064500  14890.262000

In [68]:
gapminder.groupby('region')[['life', 'fertility']].sum()

                                     life     fertility
region
America                     137444.502000   6972.122780
East Asia & Pacific         105839.919880   5961.337160
Europe & Central Asia       184144.135015   5646.152556
Middle East & North Africa   68454.016000   5218.520000
South Asia                   22855.084000   2001.665000
Sub-Saharan Africa          129161.064500  14890.262000

In [69]:
gapminder.groupby('region')[['life', 'fertility']].transform(sum)

                life     fertility
0       22855.084000   2001.665000
1       22855.084000   2001.665000
2       22855.084000   2001.665000
3       22855.084000   2001.665000
4       22855.084000   2001.665000
5       22855.084000   2001.665000
6       22855.084000   2001.665000
7       22855.084000   2001.665000
8       22855.084000   2001.665000
9       22855.084000   2001.665000
10      22855.084000   2001.665000
11      22855.084000   2001.665000
12      22855.084000   2001.665000
13      22855.084000   2001.665000
14      22855.084000   2001.665000
15      22855.084000   2001.665000
16      22855.084000   2001.665000
17      22855.084000   2001.665000
18      22855.084000   2001.665000
19      22855.084000   2001.665000
20      22855.084000   2001.665000
21      22855.084000   2001.665000
22      22855.084000   2001.665000
23      22855.084000   2001.665000
24      22855.084000   2001.665000
25      22855.084000   2001.665000
26      22855.084000   2001.665000
27      22855.084000   2001.665000
28      22855.084000   2001.665000
29      22855.084000   2001.665000
...              ...           ...
10081  129161.064500  14890.262000
10082  129161.064500  14890.262000
10083  129161.064500  14890.262000
10084  129161.064500  14890.262000
10085  129161.064500  14890.262000
10086  129161.064500  14890.262000
10087  129161.064500  14890.262000
10088  129161.064500  14890.262000
10089  129161.064500  14890.262000
10090  129161.064500  14890.262000
10091  129161.064500  14890.262000
10092  129161.064500  14890.262000
10093  129161.064500  14890.262000
10094  129161.064500  14890.262000
10095  129161.064500  14890.262000
10096  129161.064500  14890.262000
10097  129161.064500  14890.262000
10098  129161.064500  14890.262000
10099  129161.064500  14890.262000
10100  129161.064500  14890.262000
10101  184144.135015   5646.152556
10102  184144.135015   5646.152556
10103  184144.135015   5646.152556
10104  184144.135015   5646.152556
10105  184144.135015   5646.152556
10106  184144.135015   5646.152556
10107  184144.135015   5646.152556
10108  184144.135015   5646.152556
10109  184144.135015   5646.152556
10110  184144.135015   5646.152556

[10111 rows x 2 columns]

In [71]:
gapminder.groupby('region')[['life', 'fertility']].transform(np.mean)

            life  fertility
0      57.137710   5.004162
1      57.137710   5.004162
2      57.137710   5.004162
3      57.137710   5.004162
4      57.137710   5.004162
5      57.137710   5.004162
6      57.137710   5.004162
7      57.137710   5.004162
8      57.137710   5.004162
9      57.137710   5.004162
10     57.137710   5.004162
11     57.137710   5.004162
12     57.137710   5.004162
13     57.137710   5.004162
14     57.137710   5.004162
15     57.137710   5.004162
16     57.137710   5.004162
17     57.137710   5.004162
18     57.137710   5.004162
19     57.137710   5.004162
20     57.137710   5.004162
21     57.137710   5.004162
22     57.137710   5.004162
23     57.137710   5.004162
24     57.137710   5.004162
25     57.137710   5.004162
26     57.137710   5.004162
27     57.137710   5.004162
28     57.137710   5.004162
29     57.137710   5.004162
...          ...        ...
10081  51.664426   5.956105
10082  51.664426   5.956105
10083  51.664426   5.956105
10084  51.664426   5.956105
10085  51.664426   5.956105
10086  51.664426   5.956105
10087  51.664426   5.956105
10088  51.664426   5.956105
10089  51.664426   5.956105
10090  51.664426   5.956105
10091  51.664426   5.956105
10092  51.664426   5.956105
10093  51.664426   5.956105
10094  51.664426   5.956105
10095  51.664426   5.956105
10096  51.664426   5.956105
10097  51.664426   5.956105
10098  51.664426   5.956105
10099  51.664426   5.956105
10100  51.664426   5.956105
10101  71.931303   2.214177
10102  71.931303   2.214177
10103  71.931303   2.214177
10104  71.931303   2.214177
10105  71.931303   2.214177
10106  71.931303   2.214177
10107  71.931303   2.214177
10108  71.931303   2.214177
10109  71.931303   2.214177
10110  71.931303   2.214177

[10111 rows x 2 columns]

** Imputation by the group **

Use groupby and transform to fill missing data apprpriately for each group.

In [2]:
dfTitanic = pd.read_csv('./datasets/titanic.csv')

In [73]:
dfTitanic.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

fill missing 'age' values for passengers on the Titanic with the median age from their 'gender' and 'pclass'. To do this, we group by the 'sex' and 'pclass' columns and transform each group with a custom function to call .fillna() and impute the median value.

In [77]:
dfTitanic['age'].isnull().sum()

263

In [80]:
dfTitanic.loc[dfTitanic['age'].isnull()].head(10)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
15,1,0,"Baumann, Mr. John D",male,NaN,0,0,PC 17318,25.9250,NaN,S,NaN,NaN,"New York, NY"
37,1,1,"Bradley, Mr. George (""George Arthur Brayton"")",male,NaN,0,0,111427,26.5500,NaN,S,9,NaN,"Los Angeles, CA"
40,1,0,"Brewe, Dr. Arthur Jackson",male,NaN,0,0,112379,39.6000,NaN,C,NaN,NaN,"Philadelphia, PA"
46,1,0,"Cairns, Mr. Alexander",male,NaN,0,0,113798,31.0000,NaN,S,NaN,NaN,NaN
59,1,1,"Cassebeer, Mrs. Henry Arthur Jr (Eleanor Genev...",female,NaN,0,0,17770,27.7208,NaN,C,5,NaN,"New York, NY"
69,1,1,"Chibnall, Mrs. (Edith Martha Bowerman)",female,NaN,0,1,113505,55.0000,E33,S,6,NaN,"St Leonards-on-Sea, England Ohio"
70,1,0,"Chisholm, Mr. Roderick Robert Crispin",male,NaN,0,0,112051,0.0000,NaN,S,NaN,NaN,"Liverpool, England / Belfast"
74,1,0,"Clifford, Mr. George Quincy",male,NaN,0,0,110465,52.0000,A14,S,NaN,NaN,"Stoughton, MA"
80,1,0,"Crafton, Mr. John Bertram",male,NaN,0,0,113791,26.5500,NaN,S,NaN,NaN,"Roachdale, IN"
106,1,0,"Farthing, Mr. John",male,NaN,0,0,PC 17483,221.7792,C95,S,NaN,NaN,NaN

In [81]:
nullIndex = dfTitanic.loc[dfTitanic['age'].isnull()].head(10).index

In [82]:
nullIndex

Int64Index([15, 37, 40, 46, 59, 69, 70, 74, 80, 106], dtype='int64')

In [74]:
def imputeMedian(series):
    
    return series.fillna(series.median())

In [85]:
dfTitanic['age'] = dfTitanic.groupby(['sex', 'pclass'])['age'].transform(imputeMedian)

In [86]:
dfTitanic['age'].isnull().sum()

0

In [87]:
dfTitanic.iloc[nullIndex, :]

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
15,1,0,"Baumann, Mr. John D",male,42.0,0,0,PC 17318,25.9250,NaN,S,NaN,NaN,"New York, NY"
37,1,1,"Bradley, Mr. George (""George Arthur Brayton"")",male,42.0,0,0,111427,26.5500,NaN,S,9,NaN,"Los Angeles, CA"
40,1,0,"Brewe, Dr. Arthur Jackson",male,42.0,0,0,112379,39.6000,NaN,C,NaN,NaN,"Philadelphia, PA"
46,1,0,"Cairns, Mr. Alexander",male,42.0,0,0,113798,31.0000,NaN,S,NaN,NaN,NaN
59,1,1,"Cassebeer, Mrs. Henry Arthur Jr (Eleanor Genev...",female,36.0,0,0,17770,27.7208,NaN,C,5,NaN,"New York, NY"
69,1,1,"Chibnall, Mrs. (Edith Martha Bowerman)",female,36.0,0,1,113505,55.0000,E33,S,6,NaN,"St Leonards-on-Sea, England Ohio"
70,1,0,"Chisholm, Mr. Roderick Robert Crispin",male,42.0,0,0,112051,0.0000,NaN,S,NaN,NaN,"Liverpool, England / Belfast"
74,1,0,"Clifford, Mr. George Quincy",male,42.0,0,0,110465,52.0000,A14,S,NaN,NaN,"Stoughton, MA"
80,1,0,"Crafton, Mr. John Bertram",male,42.0,0,0,113791,26.5500,NaN,S,NaN,NaN,"Roachdale, IN"
106,1,0,"Farthing, Mr. John",male,42.0,0,0,PC 17483,221.7792,C95,S,NaN,NaN,NaN

The .apply() method when used on a groupby object performs an arbitrary function on each of the groups. These functions can be aggregations, transformations or more complex workflows. The .apply() method will then combine the results in an intelligent way.

In [94]:
gapminder_multiindex.head()

,,,fertility,life,population,child_mortality,gdp
Year,region,Country,,,,,
1964,South Asia,Afghanistan,7.671,33.639,10474903.0,339.7,1182.0
1965,South Asia,Afghanistan,7.671,34.152,10697983.0,334.1,1182.0
1966,South Asia,Afghanistan,7.671,34.662,10927724.0,328.7,1168.0
1967,South Asia,Afghanistan,7.671,35.170,11163656.0,323.3,1173.0
1968,South Asia,Afghanistan,7.671,35.674,11411022.0,318.1,1187.0

In [103]:
def disparity(gr):
    # Compute the spread of gr['gdp']: s
    s = gr['gdp'].max() - gr['gdp'].min()
    # Compute the z-score of gr['gdp'] as (gr['gdp']-gr['gdp'].mean())/gr['gdp'].std(): z
    z = (gr['gdp'] - gr['gdp'].mean())/gr['gdp'].std()
    # Return a DataFrame with the inputs {'z(gdp)':z, 'regional spread(gdp)':s}
    return pd.DataFrame({'z(gdp)':z , 'regional spread(gdp)':s})

In [109]:
gapminder.head()

,Country,Year,fertility,life,population,child_mortality,gdp,region
0,Afghanistan,1964,7.671,33.639,10474903.0,339.7,1182.0,South Asia
1,Afghanistan,1965,7.671,34.152,10697983.0,334.1,1182.0,South Asia
2,Afghanistan,1966,7.671,34.662,10927724.0,328.7,1168.0,South Asia
3,Afghanistan,1967,7.671,35.170,11163656.0,323.3,1173.0,South Asia
4,Afghanistan,1968,7.671,35.674,11411022.0,318.1,1187.0,South Asia

In [108]:
gapminder.groupby('region').apply(disparity).head()

   regional spread(gdp)    z(gdp)
0               12628.0 -0.639011
1               12628.0 -0.639011
2               12628.0 -0.645538
3               12628.0 -0.643207
4               12628.0 -0.636680

In [110]:
dfTitanic.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [ ]:
dfTitanic.groupby('pclass')

In [113]:
dfTitanic['cabin'].str.startswith('C').fillna(False).head()

0    False
1     True
2     True
3     True
4     True
Name: cabin, dtype: bool

In [144]:
def isCabinC(gr):
    
    return gr['cabin'].str.startswith('C').fillna(False)

In [129]:
def meanForCabinC(gr):
    
    cPassengers = gr['cabin'].str.startswith('C').fillna(False)
    
    return  gr.loc[cPassengers, 'survived'].mean()

In [130]:
def sumSurvivedForCabinC(gr):
    
    cPassengers = gr['cabin'].str.startswith('C').fillna(False)
    
    return  gr.loc[cPassengers, 'survived'].sum()

In [148]:
def countPassengersInCabinC(gr):
    
    cPassengers = gr['cabin'].str.startswith('C').fillna(False)
    
    return  gr.loc[cPassengers, 'survived'].count()

In [123]:
cPassengers = dfTitanic.groupby('sex').apply(isCabinC)

In [133]:
dfTitanic['survived'].count()

1309

In [134]:
dfTitanic['survived'].sum()

500

In [135]:
dfTitanic.shape

(1309, 14)

In [125]:
cPassengers

sex
female  0       False
        2        True
        4        True
        6       False
        8        True
        11       True
        12      False
        13      False
        17      False
        18      False
        21      False
        23      False
        24       True
        27      False
        28       True
        32       True
        33       True
        35      False
        36      False
        41      False
        42       True
        43      False
        44      False
        48      False
        50      False
        55      False
        57      False
        59      False
        61       True
        63      False
                ...
male    1271    False
        1272    False
        1274    False
        1275    False
        1277    False
        1278    False
        1280    False
        1281    False
        1282    False
        1283    False
        1284    False
        1285    False
        1287    False
        1288    False
        1289    False
        1291    False
        1292    False
        1293    False
        1294    False
        1295    False
        1296    False
        1297    False
        1298    False
        1299    False
        1301    False
        1302    False
        1303    False
        1306    False
        1307    False
        1308    False
Name: cabin, Length: 1309, dtype: bool

In [146]:
dfTitanic.groupby('pclass').apply(isCabinC)

pclass
1       0       False
        1        True
        2        True
        3        True
        4        True
        5       False
        6       False
        7       False
        8        True
        9       False
        10       True
        11       True
        12      False
        13      False
        14      False
        15      False
        16      False
        17      False
        18      False
        19       True
        20      False
        21      False
        22       True
        23      False
        24       True
        25      False
        26      False
        27      False
        28       True
        29       True
                ...
3       1279    False
        1280    False
        1281    False
        1282    False
        1283    False
        1284    False
        1285    False
        1286    False
        1287    False
        1288    False
        1289    False
        1290    False
        1291    False
        1292    False
        1293    False
        1294    False
        1295    False
        1296    False
        1297    False
        1298    False
        1299    False
        1300    False
        1301    False
        1302    False
        1303    False
        1304    False
        1305    False
        1306    False
        1307    False
        1308    False
Name: cabin, Length: 1309, dtype: bool

In [132]:
dfTitanic.groupby('sex').apply(meanForCabinC)

sex
female    0.913043
male      0.312500
dtype: float64

In [131]:
dfTitanic.groupby('sex').apply(sumSurvivedForCabinC)

sex
female    42
male      15
dtype: int64

In [151]:
dfTitanic.groupby('sex').apply(countPassengersInCabinC)

sex
female    46
male      48
dtype: int64

In [152]:
dfTitanic.groupby('pclass').apply(countPassengersInCabinC)

pclass
1    94
2     0
3     0
dtype: int64

In [143]:
dfTitanic.groupby('pclass').apply(meanForCabinC)

pclass
1    0.606383
2         NaN
3         NaN
dtype: float64

In [149]:
dfTitanic.groupby('pclass').apply(countPassengersInCabinC)

pclass
1    94
2     0
3     0
dtype: int64

**Using groupby and filter**

Use filter to drop companies who have total unit sale less than 35

In [156]:
sales = pd.read_csv('./datasets/sales/sales-feb-2015.csv', index_col='Date', parse_dates=True)

In [157]:
sales.head()

                             Company   Product  Units
Date
2015-02-02 08:30:00            Hooli  Software      3
2015-02-02 21:00:00        Mediacore  Hardware      9
2015-02-03 14:00:00          Initech  Software     13
2015-02-04 15:30:00        Streeplex  Software     13
2015-02-04 22:00:00  Acme Coporation  Hardware     14

In [158]:
sales.groupby('Company')['Units'].sum()

Company
Acme Coporation    34
Hooli              30
Initech            30
Mediacore          45
Streeplex          36
Name: Units, dtype: int64

In [160]:
sales.groupby('Company').filter(lambda g: g['Units'].sum() > 35)

                       Company   Product  Units
Date
2015-02-02 21:00:00  Mediacore  Hardware      9
2015-02-04 15:30:00  Streeplex  Software     13
2015-02-09 09:00:00  Streeplex   Service     19
2015-02-09 13:00:00  Mediacore  Software      7
2015-02-19 11:00:00  Mediacore  Hardware     16
2015-02-19 16:00:00  Mediacore   Service     10
2015-02-21 05:00:00  Mediacore  Software      3
2015-02-26 09:00:00  Streeplex   Service      4

In [162]:
sales.groupby('Company').filter(lambda g: g['Units'].sum() > 35)['Company'].value_counts()

Mediacore    5
Streeplex    3
Name: Company, dtype: int64

** Filtering and grouping by .map() **

Sometimes, you may want to group by a function/transformation of a column. The key here is that the Series is indexed the same way as the DataFrame. You can also mix and match column grouping with Series grouping.

We will investigate survival rates of passengers on the Titanic by 'age' and 'pclass'. In particular, the goal is to find out what fraction of children under 10 survived in each 'pclass'. 

The 'survived' column has the value 1 if the passenger survived and 0 otherwise. The mean of the 'survived' column is the fraction of passengers who lived.

In [3]:
under10 = (dfTitanic['age'] < 10).map({True: 'under 10', False: 'over 10'})

In [4]:
under10.head()

0     over 10
1    under 10
2    under 10
3     over 10
4     over 10
Name: age, dtype: object

In [5]:
under10.tail()

1304    over 10
1305    over 10
1306    over 10
1307    over 10
1308    over 10
Name: age, dtype: object

In [6]:
dfTitanic.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [7]:
dfTitanic.tail()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
1304,3,0,"Zabour, Miss. Hileni",female,14.5,1,0,2665,14.4542,NaN,C,NaN,328.0,NaN
1305,3,0,"Zabour, Miss. Thamine",female,NaN,1,0,2665,14.4542,NaN,C,NaN,NaN,NaN
1306,3,0,"Zakarian, Mr. Mapriededer",male,26.5,0,0,2656,7.2250,NaN,C,NaN,304.0,NaN
1307,3,0,"Zakarian, Mr. Ortin",male,27.0,0,0,2670,7.2250,NaN,C,NaN,NaN,NaN
1308,3,0,"Zimmerman, Mr. Leo",male,29.0,0,0,315082,7.8750,NaN,S,NaN,NaN,NaN

Note that under10 and dfTitanic have the same index. Therefore, we can use under10 to groupby dfTitanic.

In [8]:
dfTitanic.groupby(under10)['survived'].mean()

age
over 10     0.366748
under 10    0.609756
Name: survived, dtype: float64

In [9]:
dfTitanic.groupby([under10, 'pclass'])['survived'].mean()

age       pclass
over 10   1         0.617555
          2         0.380392
          3         0.238897
under 10  1         0.750000
          2         1.000000
          3         0.446429
Name: survived, dtype: float64

In [10]:
dfOlympic = pd.read_csv('./datasets/all_medalists.csv')

In [11]:
dfOlympic.head()

,City,Edition,Sport,Discipline,Athlete,NOC,Gender,Event,Event_gender,Medal
0,Athens,1896,Aquatics,Swimming,"HAJOS, Alfred",HUN,Men,100m freestyle,M,Gold
1,Athens,1896,Aquatics,Swimming,"HERSCHMANN, Otto",AUT,Men,100m freestyle,M,Silver
2,Athens,1896,Aquatics,Swimming,"DRIVAS, Dimitrios",GRE,Men,100m freestyle for sailors,M,Bronze
3,Athens,1896,Aquatics,Swimming,"MALOKINIS, Ioannis",GRE,Men,100m freestyle for sailors,M,Gold
4,Athens,1896,Aquatics,Swimming,"CHASAPIS, Spiridon",GRE,Men,100m freestyle for sailors,M,Silver

In [14]:
dfOlympic['NOC'].value_counts().head(20)

USA    4335
URS    2049
GBR    1594
FRA    1314
ITA    1228
GER    1211
AUS    1075
HUN    1053
SWE    1021
GDR     825
NED     782
JPN     704
CHN     679
RUS     638
ROU     624
CAN     592
NOR     537
POL     499
DEN     491
FRG     490
Name: NOC, dtype: int64

Now, let's get the medal count for the country for each medal type.

In [21]:
dfOlympic.pivot_table(index = 'NOC', columns='Medal', values='Athlete', aggfunc='count').head(10)

Medal  Bronze   Gold  Silver
NOC
AFG       1.0    NaN     NaN
AHO       NaN    NaN     1.0
ALG       8.0    4.0     2.0
ANZ       5.0   20.0     4.0
ARG      88.0   68.0    83.0
ARM       7.0    1.0     1.0
AUS     413.0  293.0   369.0
AUT      44.0   21.0    81.0
AZE       9.0    4.0     3.0
BAH       5.0    9.0     9.0

In [22]:
dfOlympic.pivot_table(index = 'NOC', columns='Medal', values='Sport', aggfunc='count').head(10)

Medal  Bronze   Gold  Silver
NOC
AFG       1.0    NaN     NaN
AHO       NaN    NaN     1.0
ALG       8.0    4.0     2.0
ANZ       5.0   20.0     4.0
ARG      88.0   68.0    83.0
ARM       7.0    1.0     1.0
AUS     413.0  293.0   369.0
AUT      44.0   21.0    81.0
AZE       9.0    4.0     3.0
BAH       5.0    9.0     9.0

It doesn't matter here which column we use for values. All we want to do is get a count.

In [39]:
dfPivot = dfOlympic.pivot_table(index = 'NOC', columns='Medal', values='Discipline', aggfunc='count')
dfPivot['totals'] = dfPivot.sum(axis = 1)
dfPivot.sort_values(by = 'totals', ascending=False, inplace=True)
dfPivot.head(10)

Medal  Bronze    Gold  Silver  totals
NOC
USA    1052.0  2088.0  1195.0  4335.0
URS     584.0   838.0   627.0  2049.0
GBR     505.0   498.0   591.0  1594.0
FRA     475.0   378.0   461.0  1314.0
ITA     374.0   460.0   394.0  1228.0
GER     454.0   407.0   350.0  1211.0
AUS     413.0   293.0   369.0  1075.0
HUN     345.0   400.0   308.0  1053.0
SWE     325.0   347.0   349.0  1021.0
GDR     225.0   329.0   271.0   825.0

In [40]:
evGen = dfOlympic[['Event_gender', 'Gender']]

In [41]:
evGen

      Event_gender Gender
0                M    Men
1                M    Men
2                M    Men
3                M    Men
4                M    Men
5                M    Men
6                M    Men
7                M    Men
8                M    Men
9                M    Men
10               M    Men
11               M    Men
12               M    Men
13               M    Men
14               M    Men
15               M    Men
16               M    Men
17               M    Men
18               M    Men
19               M    Men
20               M    Men
21               M    Men
22               M    Men
23               M    Men
24               M    Men
25               M    Men
26               M    Men
27               M    Men
28               M    Men
29               M    Men
...            ...    ...
29186            M    Men
29187            M    Men
29188            M    Men
29189            M    Men
29190            M    Men
29191            M    Men
29192            M    Men
29193            M    Men
29194            M    Men
29195            M    Men
29196            M    Men
29197            M    Men
29198            M    Men
29199            M    Men
29200            M    Men
29201            M    Men
29202            M    Men
29203            M    Men
29204            M    Men
29205            M    Men
29206            M    Men
29207            M    Men
29208            M    Men
29209            M    Men
29210            M    Men
29211            M    Men
29212            M    Men
29213            M    Men
29214            M    Men
29215            M    Men

[29216 rows x 2 columns]

In [42]:
evGen.drop_duplicates()

      Event_gender Gender
0                M    Men
348              X    Men
416              W  Women
639              X  Women
23675            W    Men

In [53]:
evGen.loc[348]

Event_gender      X
Gender          Men
Name: 348, dtype: object

In [54]:
evGen.loc[347]

Event_gender      M
Gender          Men
Name: 347, dtype: object

In [55]:
evGen.loc[349]

Event_gender      X
Gender          Men
Name: 349, dtype: object

In [43]:
dfOlympic['Gender'].drop_duplicates()

0        Men
416    Women
Name: Gender, dtype: object

In [44]:
dfOlympic['Gender'].value_counts()

Men      21721
Women     7495
Name: Gender, dtype: int64

In [46]:
dfOlympic.loc[415, 'Gender']

'Men'

In [51]:
dfOlympic.loc[416, 'Gender']

'Women'

Looks like index for drop_duplicates() is the first time you run into that combination. 

drop_duplicates() is a nifty way of seeing what all unique combinations are there.

In [52]:
evGen.value_counts()

AttributeError: 'DataFrame' object has no attribute 'value_counts'

Only series have attribute value_counts().

In [56]:
dfOlympic.head()

,City,Edition,Sport,Discipline,Athlete,NOC,Gender,Event,Event_gender,Medal
0,Athens,1896,Aquatics,Swimming,"HAJOS, Alfred",HUN,Men,100m freestyle,M,Gold
1,Athens,1896,Aquatics,Swimming,"HERSCHMANN, Otto",AUT,Men,100m freestyle,M,Silver
2,Athens,1896,Aquatics,Swimming,"DRIVAS, Dimitrios",GRE,Men,100m freestyle for sailors,M,Bronze
3,Athens,1896,Aquatics,Swimming,"MALOKINIS, Ioannis",GRE,Men,100m freestyle for sailors,M,Gold
4,Athens,1896,Aquatics,Swimming,"CHASAPIS, Spiridon",GRE,Men,100m freestyle for sailors,M,Silver

In [57]:
dfOlympic.groupby(['Gender', 'Event_gender']).count()

                      City  Edition  Sport  Discipline  Athlete    NOC  Event  \
Gender Event_gender
Men    M             20067    20067  20067       20067    20067  20067  20067
       W                 1        1      1           1        1      1      1
       X              1653     1653   1653        1653     1653   1653   1653
Women  W              7277     7277   7277        7277     7277   7277   7277
       X               218      218    218         218      218    218    218

                     Medal
Gender Event_gender
Men    M             20067
       W                 1
       X              1653
Women  W              7277
       X               218

Shows that there is only one entry with the combination (Gender = Men, Event_gender = W). It's probably an error. Let's identify that data point.

In [59]:
dfOlympic.loc[(dfOlympic.Gender == 'Men') & (dfOlympic.Event_gender == 'W')]

,City,Edition,Sport,Discipline,Athlete,NOC,Gender,Event,Event_gender,Medal
23675,Sydney,2000,Athletics,Athletics,"CHEPCHUMBA, Joyce",KEN,Men,marathon,W,Bronze

In [60]:
dfOlympic[(dfOlympic.Gender == 'Men') & (dfOlympic.Event_gender == 'W')]

,City,Edition,Sport,Discipline,Athlete,NOC,Gender,Event,Event_gender,Medal
23675,Sydney,2000,Athletics,Athletics,"CHEPCHUMBA, Joyce",KEN,Men,marathon,W,Bronze

Let's say want to know which countries won medals in the most distinct sports. The .nunique() method is the principal aggregation here.

In [63]:
dfOlympic.groupby('NOC')['Sport'].nunique().sort_values(ascending = False).head(10)

NOC
USA    34
GBR    31
FRA    28
GER    26
CHN    24
AUS    22
ESP    22
CAN    22
SWE    21
URS    21
Name: Sport, dtype: int64

Counting USA vs. USSR medals during cold war period

In [66]:
duringColdWar = (dfOlympic.Edition >= 1952) & (dfOlympic.Edition <= 1988)

In [68]:
dfOlympicDuringColdWar = dfOlympic[duringColdWar]

In [69]:
dfOlympicDuringColdWar.head()

,City,Edition,Sport,Discipline,Athlete,NOC,Gender,Event,Event_gender,Medal
8018,Helsinki,1952,Aquatics,Diving,"HAASE, Günther",GER,Men,10m platform,M,Bronze
8019,Helsinki,1952,Aquatics,Diving,"LEE, Samuel",USA,Men,10m platform,M,Gold
8020,Helsinki,1952,Aquatics,Diving,"CAPILLA PEREZ, Joaquin",MEX,Men,10m platform,M,Silver
8021,Helsinki,1952,Aquatics,Diving,"STOVER-IRWIN, Juno Roslays",USA,Women,10m platform,W,Bronze
8022,Helsinki,1952,Aquatics,Diving,"MCCORMICK, Patricia",USA,Women,10m platform,W,Gold

In [70]:
dfOlympicDuringColdWarRivals = dfOlympicDuringColdWar[dfOlympicDuringColdWar['NOC'].isin(['USA', 'URS'])]

In [72]:
dfOlympicDuringColdWarRivals.groupby('NOC')['Discipline'].nunique()

NOC
URS    28
USA    28
Name: Discipline, dtype: int64

In [73]:
dfOlympicDuringColdWarRivals.groupby('NOC')['Sport'].nunique()

NOC
URS    21
USA    20
Name: Sport, dtype: int64

In [74]:
dfOlympic.Sport.nunique()

42

In [75]:
dfOlympic.Discipline.nunique()

56

Let's find out which country USA or USSR won the most medals consistently over the cold war period.

In [76]:
medalsByCountry = dfOlympic.pivot_table(index = 'Edition', columns = 'NOC', values = 'Athlete', aggfunc = 'count')

In [77]:
medalsByCountry.head(10)

NOC,AFG,AHO,ALG,ANZ,ARG,ARM,AUS,AUT,AZE,BAH,...,URS,URU,USA,UZB,VEN,VIE,YUG,ZAM,ZIM,ZZX
Edition,,,,,,,,,,,,,,,,,,,,,
1896,NaN,NaN,NaN,NaN,NaN,NaN,2.0,5.0,NaN,NaN,...,NaN,NaN,20.0,NaN,NaN,NaN,NaN,NaN,NaN,6.0
1900,NaN,NaN,NaN,NaN,NaN,NaN,5.0,6.0,NaN,NaN,...,NaN,NaN,55.0,NaN,NaN,NaN,NaN,NaN,NaN,34.0
1904,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1.0,NaN,NaN,...,NaN,NaN,394.0,NaN,NaN,NaN,NaN,NaN,NaN,8.0
1908,NaN,NaN,NaN,19.0,NaN,NaN,NaN,1.0,NaN,NaN,...,NaN,NaN,63.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1912,NaN,NaN,NaN,10.0,NaN,NaN,NaN,14.0,NaN,NaN,...,NaN,NaN,101.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1920,NaN,NaN,NaN,NaN,NaN,NaN,6.0,NaN,NaN,NaN,...,NaN,NaN,193.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1924,NaN,NaN,NaN,NaN,11.0,NaN,10.0,4.0,NaN,NaN,...,NaN,22.0,198.0,NaN,NaN,NaN,2.0,NaN,NaN,NaN
1928,NaN,NaN,NaN,NaN,32.0,NaN,4.0,4.0,NaN,NaN,...,NaN,22.0,84.0,NaN,NaN,NaN,12.0,NaN,NaN,NaN
1932,NaN,NaN,NaN,NaN,4.0,NaN,5.0,5.0,NaN,NaN,...,NaN,1.0,181.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1936,NaN,NaN,NaN,NaN,11.0,NaN,1.0,50.0,NaN,NaN,...,NaN,NaN,92.0,NaN,NaN,NaN,1.0,NaN,NaN,NaN

NaN is when country has no medals for the given year.

In [78]:
medalsByCountry['IND']

Edition
1896     NaN
1900     2.0
1904     NaN
1908     NaN
1912     NaN
1920     NaN
1924     NaN
1928    15.0
1932    11.0
1936    19.0
1948    20.0
1952    15.0
1956    17.0
1960    13.0
1964    15.0
1968    15.0
1972    14.0
1976     NaN
1980    16.0
1984     NaN
1988     NaN
1992     NaN
1996     1.0
2000     1.0
2004     1.0
2008     3.0
Name: IND, dtype: float64

In [86]:
dfOlympic[(dfOlympic.NOC == 'IND') & (dfOlympic.Edition > 1947) & (dfOlympic.Sport != 'Hockey')]

,City,Edition,Sport,Discipline,Athlete,NOC,Gender,Event,Event_gender,Medal
8865,Helsinki,1952,Wrestling,Wrestling Free.,"JADAV, Kha-Shaba Digvijai",IND,Men,52 - 57kg (bantamweight),M,Bronze
22981,Atlanta,1996,Tennis,Tennis,"PAES, Leander",IND,Men,singles,M,Bronze
25113,Sydney,2000,Weightlifting,Weightlifting,"MALLESWARI, Karnam",IND,Women,69kg,W,Bronze
26870,Athens,2004,Shooting,Shooting,"RATHORE, Rajyavardhan S.",IND,Men,double trap (150 targets),M,Silver
27922,Beijing,2008,Boxing,Boxing,"KUMAR, Vijender",IND,Men,69 - 75 kg,M,Bronze
28856,Beijing,2008,Shooting,Shooting,"BINDRA, Abhinav",IND,Men,10m air rifle (60 shots),M,Gold
29165,Beijing,2008,Wrestling,Wrestling Free.,"KUMAR, Sushil",IND,Men,60 - 66kg,M,Bronze

Let's now filter the cold war period and cold war rivals

In [87]:
medalsByCountry.head()

NOC,AFG,AHO,ALG,ANZ,ARG,ARM,AUS,AUT,AZE,BAH,...,URS,URU,USA,UZB,VEN,VIE,YUG,ZAM,ZIM,ZZX
Edition,,,,,,,,,,,,,,,,,,,,,
1896,NaN,NaN,NaN,NaN,NaN,NaN,2.0,5.0,NaN,NaN,...,NaN,NaN,20.0,NaN,NaN,NaN,NaN,NaN,NaN,6.0
1900,NaN,NaN,NaN,NaN,NaN,NaN,5.0,6.0,NaN,NaN,...,NaN,NaN,55.0,NaN,NaN,NaN,NaN,NaN,NaN,34.0
1904,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1.0,NaN,NaN,...,NaN,NaN,394.0,NaN,NaN,NaN,NaN,NaN,NaN,8.0
1908,NaN,NaN,NaN,19.0,NaN,NaN,NaN,1.0,NaN,NaN,...,NaN,NaN,63.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1912,NaN,NaN,NaN,10.0,NaN,NaN,NaN,14.0,NaN,NaN,...,NaN,NaN,101.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [92]:
medalsColdWarByYear = medalsByCountry.loc[1952:1988, ['USA', 'URS']]
medalsColdWarByYear

NOC        USA    URS
Edition
1952     130.0  117.0
1956     118.0  169.0
1960     112.0  169.0
1964     150.0  174.0
1968     149.0  188.0
1972     155.0  211.0
1976     155.0  285.0
1980       NaN  442.0
1984     333.0    NaN
1988     193.0  294.0

In [106]:
medalsMost = medalsColdWarByYear.idxmax(axis = 1)

In [96]:
medalsMost.value_counts()

URS    8
USA    2
dtype: int64

In [98]:
medalsMost

Edition
1952    USA
1956    URS
1960    URS
1964    URS
1968    URS
1972    URS
1976    URS
1980    URS
1984    USA
1988    URS
dtype: object

In [100]:
medalsColdWarByYear.index.name

'Edition'